e-yes/nuttx/arch/risc-v/src/bl702/bl702_netdev.c
/****************************************************************************
 * arch/risc-v/src/bl702/bl702_netdev.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <stdbool.h>
#include <time.h>
#include <string.h>
#include <errno.h>
#include <assert.h>
#include <debug.h>
#include <sched.h>
#include <nuttx/semaphore.h>
#include <nuttx/nuttx.h>
#include <nuttx/kmalloc.h>
#include <nuttx/list.h>
#include <nuttx/signal.h>

#include <sys/types.h>

#include <arpa/inet.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/wqueue.h>
#include <nuttx/net/arp.h>
#include <nuttx/net/net.h>
#include <nuttx/net/netdev.h>
#include <nuttx/wireless/wireless.h>

#ifdef CONFIG_NET_PKT
#include <nuttx/net/pkt.h>
#endif

#include "wifi_manager/include/bitset.h"
#include "wifi_manager/wifi_mgmr.h"
#include "wifi_manager/wifi_mgmr_api.h"
#include "wifi_manager/bl_wifi.h"
#include "wifi_manager/include/wifi_mgmr_ext.h"
#include "bl702_os_hal.h"
#include "bl702_netdev.h"
#include "bl702_efuse.h"

#ifdef CONFIG_BL702_WIRELESS

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Work queue support is required. */

#if !defined(CONFIG_SCHED_WORKQUEUE)
#error Work queue support is required in this configuration (CONFIG_SCHED_WORKQUEUE)
#endif

/* The low priority work queue is preferred.  If it is not enabled, LPWORK
 * will be the same as HPWORK.
 *
 * NOTE:  However, the network should NEVER run on the high priority work
 * queue!  That queue is intended only to service short back end interrupt
 * processing that never suspends.  Suspending the high priority work queue
 * may bring the system to its knees!
 */

/* FIXME According to some network IO throughput tests, using HPWORK will
 * get higher throughput.
 */

#define ETHWORK HPWORK

/* BL702_NET_NINTERFACES determines the number of physical interfaces
 * that will be supported.
 */

#ifndef CONFIG_BL702_NET_MULTI_INTERFACE
#define BL702_NET_NINTERFACES 1
#else
#define BL702_NET_NINTERFACES 2
#endif

#define WIFI_MTU_SIZE 1516

#define BL702_NET_TXBUFF_NUM  12
#define BL702_NET_TXBUFF_SIZE (WIFI_MTU_SIZE + PRESERVE_80211_HEADER_LEN)

#define BL702_TXDESC_THRESHOLD 3

#if BL702_NET_TXBUFF_SIZE & 0x3 != 0
#error "BL702_NET_TXBUFF_SIZE must be aligned to 4 bytes"
#endif

#if !(BL702_TXDESC_THRESHOLD > 0)
#error "BL702_TXDESC_THRESHOLD invalid."
#endif

#define TX_BUFF_BIT_SIZE BL702_NET_TXBUFF_NUM

/* This is a helper pointer for accessing the contents of Ethernet header */

#define BUF ((struct eth_hdr_s *)priv->net_dev.d_buf)

#define WIFI_MGMR wifiMgmr

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* The bl702_net_driver_s encapsulates all state information for a single
 * hardware interface
 */

struct bl702_net_driver_s
{
  struct work_s availwork;

  /* wifi manager */

  struct wlan_netif *wlan;

  /* there is impossble to concurrency access these fields, so
   * we use bit-field to save some little space :)
   */

  unsigned int current_mode : 2;    /* current mode */
  unsigned int push_cnt : 4;        /* max 16 */
  unsigned int prev_connectd : 1;   /* mark of prev connection status */

  uint16_t channel; /* FIXME freq number. eg. 3, 0 is not set */

  char bssid[18]; /* AP mac address */

  /* This holds the information visible to the NuttX network */

  struct net_driver_s net_dev; /* Interface understood by the network */
};

struct scan_parse_param_s
{
  struct bl702_net_driver_s *priv;

  int                flags;
  struct iw_scan_req scan_req;
};

BITSET_DEFINE(tx_buf_ind_s, TX_BUFF_BIT_SIZE);

typedef uint8_t (*tx_buff_t)[BL702_NET_TXBUFF_SIZE];

/* When a data packet is received, the NuttX protocol stack may use this
 * RX buffer to construct a response data packet. However, the WiFi Firmware
 * does not support using the RX buffer as the TX buffer directly, so it is
 * necessary to allocate a TX buffer to make a copy.
 * If there is no TX buffer, the response packet will be discarded.
 * Therefore, when a data packet is received, it will check whether there is
 * an available TX buffer. If not, it will hang the RX packet in this linked
 * list, and wait until TX buffer is available before submitting it to the
 * NuttX protocol stack.
 */

struct rx_pending_item_s
{
  struct list_node node;
  struct bl702_net_driver_s *priv; /* Which interface should to deliver */
  uint8_t *        data;
  int              len;
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Driver state structure */

struct bl702_net_driver_s g_bl702_net[BL702_NET_NINTERFACES];

static struct tx_buf_ind_s g_tx_buf_indicator =
  BITSET_T_INITIALIZER((1 << BL702_NET_TXBUFF_NUM) - 1);

static uint8_t locate_data(".wifi_ram.txbuff")
g_tx_buff[BL702_NET_TXBUFF_NUM][BL702_NET_TXBUFF_SIZE];

static sem_t g_wifi_scan_sem; /* wifi scan complete semaphore */
static sem_t g_wifi_connect_sem;

/* Rx Pending List */

static struct list_node g_rx_pending;

/* Firmware default config */

static wifi_conf_t g_conf =
{
  .country_code = CONFIG_BL702_WIRELESS_CONTRY_CODE,
};

/* Global state */

static struct
{
  uint32_t scan_result_status : 2; /* WiFi scan result status */
  uint32_t scan_result_len : 6;
  uint32_t retry_cnt : 4; /* MAX 16 retries */
  uint32_t sta_connected: 1;
  uint32_t ap_stared: 1;
} g_state;

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

extern int  bl_output(struct bl_hw *bl_hw, char *p, int tot_len, int is_sta);
extern void bl_free_rx_buffer(void *p);
extern void bl_irq_handler(void);
extern void wifi_main_init(void);
extern void ipc_emb_notify(void);
extern void wifi_mgmr_tsk_init(void);
extern int bl702_ef_ctrl_read_mac_address(uint8_t mac[6]);
extern void wifi_main(int argc, char *argv[]);
extern void wifi_mgmr_start_background(wifi_conf_t *conf);
extern int bl_pm_init(void);
extern struct net_device bl606a0_sta;

/* Common TX logic */

static int bl702_net_transmit(struct bl702_net_driver_s *priv);
static int bl702_net_txpoll(struct net_driver_s *dev);

/* Interrupt handling */

static void bl702_net_reply(struct bl702_net_driver_s *priv);
static void bl702_net_receive(struct bl702_net_driver_s *priv);

/* NuttX callback functions */

static int bl702_net_ifup(struct net_driver_s *dev);
static int bl702_net_ifdown(struct net_driver_s *dev);

