e-yes/nuttx/arch/risc-v/src/bl702/bl702_netdev.c
static void bl702_net_txavail_work(void *arg);
static int  bl702_net_txavail(struct net_driver_s *dev);

#if defined(CONFIG_NET_MCASTGROUP) || defined(CONFIG_NET_ICMPv6)
static int bl702_net_addmac(struct net_driver_s *dev,
                            const uint8_t *mac);
# ifdef CONFIG_NET_MCASTGROUP
static int bl702_net_rmmac(struct net_driver_s *dev,
                           const uint8_t *mac);
# endif
# ifdef CONFIG_NET_ICMPv6
static void bl702_net_ipv6multicast(struct bl702_net_driver_s *priv);
# endif
#endif

#ifdef CONFIG_NETDEV_IOCTL
static int
bl702_net_ioctl(struct net_driver_s *dev, int cmd, unsigned long arg);
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: bl702_net_transmit
 *
 * Description:
 *   Start hardware transmission.  Called either from the txdone interrupt
 *   handling or from watchdog based polling.
 *
 * Input Parameters:
 *   priv - Reference to the driver state structure
 *
 * Returned Value:
 *   OK on success; a negated errno on failure
 *
 * Assumptions:
 *   The network is locked.
 *
 ****************************************************************************/

static int bl702_net_transmit(struct bl702_net_driver_s *priv)
{
  int ret = OK;
  ninfo("tx pkt len:%d\n", priv->net_dev.d_len);

  DEBUGASSERT(priv->net_dev.d_len <= WIFI_MTU_SIZE);
  DEBUGASSERT(priv->push_cnt < BL702_TXDESC_THRESHOLD);

  if (!IFF_IS_RUNNING(priv->net_dev.d_flags))
    {
      nwarn("drop packet due to iface no carrier\n");
      bl702_netdev_free_txbuf(priv->net_dev.d_buf -
                              PRESERVE_80211_HEADER_LEN);
      priv->net_dev.d_buf = NULL;

      return -EPERM;
    }

  DEBUGASSERT(priv->wlan != NULL);

  /* Increment statistics */

  NETDEV_TXPACKETS(priv->net_dev);

  bl_output(bl606a0_sta.bl_hw,
            (char *)priv->net_dev.d_buf,
            priv->net_dev.d_len,
            0 == priv->wlan->mode);

  priv->push_cnt++;

  if (priv->push_cnt == BL702_TXDESC_THRESHOLD)
    {
      /* notify to tx now */

      bl_irq_handler();
      priv->push_cnt = 0;
    }

  priv->net_dev.d_buf = NULL;

  return ret;
}

/****************************************************************************
 * Name: bl702_net_txpoll
 *
 * Description:
 *   The transmitter is available, check if the network has any outgoing
 *   packets ready to send.  This is a callback from devif_poll().
 *   devif_poll() may be called:
 *
 *   1. When the preceding TX packet send is complete,
 *   2. When the preceding TX packet send timesout and the interface is reset
 *   3. During normal TX polling
 *
 * Input Parameters:
 *   dev - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   OK on success; a negated errno on failure
 *
 * Assumptions:
 *   The network is locked.
 *
 ****************************************************************************/

static int bl702_net_txpoll(struct net_driver_s *dev)
{
  struct bl702_net_driver_s *priv =
    (struct bl702_net_driver_s *)dev->d_private;

  if (priv->net_dev.d_len > 0)
    {
      DEBUGASSERT(priv->net_dev.d_buf);

      /* Look up the destination MAC address and add it to the Ethernet
       * header.
       */

#ifdef CONFIG_NET_IPv4
#ifdef CONFIG_NET_IPv6
      if (IFF_IS_IPv4(priv->net_dev.d_flags))
#endif
        {
          arp_out(&priv->net_dev);
        }
#endif /* CONFIG_NET_IPv4 */

#ifdef CONFIG_NET_IPv6
#ifdef CONFIG_NET_IPv4
      else
#endif
        {
          neighbor_out(&priv->net_dev);
        }
#endif /* CONFIG_NET_IPv6 */

      /* Check if the network is sending this packet to the IP address of
       * this device.  If so, just loop the packet back into the network but
       * don't attempt to put it on the wire.
       */

      if (!devif_loopback(&priv->net_dev))
        {
          /* Send the packet */

          bl702_net_transmit(priv);

          /* Check if there is room in the device to hold another packet.
           * If not, return a non-zero value to terminate the poll.
           */

          priv->net_dev.d_buf = bl702_netdev_alloc_txbuf();
          if (priv->net_dev.d_buf)
            {
              priv->net_dev.d_buf += PRESERVE_80211_HEADER_LEN;
              priv->net_dev.d_len = 0;
            }

          return priv->net_dev.d_buf == NULL;
        }
    }

  /* If zero is returned, the polling will continue until all connections
   * have been examined.
   */

  return 0;
}

/****************************************************************************
 * Name: bl702_net_reply
 *
 * Description:
 *   After a packet has been received and dispatched to the network, it
 *   may return return with an outgoing packet.  This function checks for
 *   that case and performs the transmission if necessary.
 *
 * Input Parameters:
 *   priv - Reference to the driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   The network is locked.
 *
 ****************************************************************************/

static void bl702_net_reply(struct bl702_net_driver_s *priv)
{
  uint8_t *tx_p = NULL;

  /* If the packet dispatch resulted in data that should be sent out on the
   * network, the field d_len will set to a value > 0.
   */

  if (priv->net_dev.d_len > 0)
    {
      /* Update the Ethernet header with the correct MAC address */

#ifdef CONFIG_NET_IPv4
#ifdef CONFIG_NET_IPv6
      /* Check for an outgoing IPv4 packet */

      if (IFF_IS_IPv4(priv->net_dev.d_flags))
#endif
        {
          arp_out(&priv->net_dev);
        }
#endif

#ifdef CONFIG_NET_IPv6
#ifdef CONFIG_NET_IPv4
      /* Otherwise, it must be an outgoing IPv6 packet */

      else
#endif
        {
          neighbor_out(&priv->net_dev);
        }
#endif

      /* alloc tx buffer and copy to it */

      tx_p = bl702_netdev_alloc_txbuf();
      if (tx_p)
        {
          tx_p += PRESERVE_80211_HEADER_LEN;
          DEBUGASSERT(priv->net_dev.d_len <=
                 BL702_NET_TXBUFF_SIZE - PRESERVE_80211_HEADER_LEN);

