e-yes/nuttx/arch/risc-v/src/bl702/bl702_netdev.c
          /* we copy it, and release rx buffer */

          memcpy(tx_p, priv->net_dev.d_buf, priv->net_dev.d_len);

          bl_free_rx_buffer(priv->net_dev.d_buf);

          priv->net_dev.d_buf = tx_p;

          bl702_net_transmit(priv);

#if BL702_TXDESC_THRESHOLD > 1
          /* notify to tx now */

          bl_irq_handler();
          priv->push_cnt = 0;
#endif

          return;
        }
      else
        {
          /* NOTIC: The release path of tx buffer cannot acquire net lock */

          nerr("can not replay due to no tx buffer!\n");
          PANIC();
        }
    }

  /* we not have tx buffer, so we lost this packet */

  bl_free_rx_buffer(priv->net_dev.d_buf);
  priv->net_dev.d_buf = NULL;
}

/****************************************************************************
 * Name: bl702_net_receive
 *
 * Description:
 *   An interrupt was received indicating the availability of a new RX packet
 *
 * Input Parameters:
 *   priv - Reference to the driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   The network is locked.
 *
 ****************************************************************************/

static void bl702_net_receive(struct bl702_net_driver_s *priv)
{
#ifdef CONFIG_NET_PKT
  /* When packet sockets are enabled, feed the frame into the tap */

  pkt_input(&priv->net_dev);
#endif

#ifdef CONFIG_NET_IPv4
  /* Check for an IPv4 packet */

  if (BUF->type == HTONS(ETHTYPE_IP))
    {
      ninfo("IPv4 frame\n");
      NETDEV_RXIPV4(&priv->net_dev);

      /* Handle ARP on input, then dispatch IPv4 packet to the network
       * layer.
       */

      arp_ipin(&priv->net_dev);
      ipv4_input(&priv->net_dev);

      /* Check for a reply to the IPv4 packet */

      bl702_net_reply(priv);
    }
  else
#endif
#ifdef CONFIG_NET_IPv6
  /* Check for an IPv6 packet */

  if (BUF->type == HTONS(ETHTYPE_IP6))
    {
      ninfo("IPv6 frame\n");
      NETDEV_RXIPV6(&priv->net_dev);

      /* Dispatch IPv6 packet to the network layer */

      ipv6_input(&priv->net_dev);

      /* Check for a reply to the IPv6 packet */

      bl702_net_reply(priv);
    }
  else
#endif
#ifdef CONFIG_NET_ARP
  /* Check for an ARP packet */

  if (BUF->type == HTONS(ETHTYPE_ARP))
    {
      /* Dispatch ARP packet to the network layer */

      arp_arpin(&priv->net_dev);
      NETDEV_RXARP(&priv->net_dev);

      if (priv->net_dev.d_len > 0)
        {
          uint8_t *tx_p = bl702_netdev_alloc_txbuf();
          if (tx_p != NULL)
            {
              DEBUGASSERT(priv->net_dev.d_len <=
                     BL702_NET_TXBUFF_SIZE - PRESERVE_80211_HEADER_LEN);

              tx_p += PRESERVE_80211_HEADER_LEN;

              /* we copy it, and release rx buffer */

              memcpy(tx_p, priv->net_dev.d_buf, priv->net_dev.d_len);

              bl_free_rx_buffer(priv->net_dev.d_buf);

              priv->net_dev.d_buf = tx_p;
              bl702_net_transmit(priv);

#if BL702_TXDESC_THRESHOLD > 1
              /* notify to tx now */

              bl_irq_handler();
              priv->push_cnt = 0;
#endif
              return;
            }
          else
            {
              nerr("can not replay due to no tx buffer!\n");
              PANIC();
            }
        }

      /* we not have tx buffer, so we lost this packet */

      bl_free_rx_buffer(priv->net_dev.d_buf);
      priv->net_dev.d_buf = NULL;
    }
  else
#endif
    {
      NETDEV_RXDROPPED(&priv->net_dev);
      bl_free_rx_buffer(priv->net_dev.d_buf);
      priv->net_dev.d_buf = NULL;
    }
}

static int bl702_launch_pending_rx(void)
{
  struct rx_pending_item_s *item;
  irqstate_t                irqstate;
  int                       tx_buf_empty;

  while (1)
    {
      net_lock();

      irqstate     = enter_critical_section();
      tx_buf_empty = BIT_EMPTY(TX_BUFF_BIT_SIZE, &g_tx_buf_indicator);
      leave_critical_section(irqstate);

      if (tx_buf_empty)
        {
          /* we dont have tx buffer, so we cant go ahead, abort.. */

          nwarn("tx buf empty!\n");

          net_unlock();
          return -ENOMEM;
        }

      irqstate = enter_critical_section();
      item =
        list_remove_head_type(&g_rx_pending, struct rx_pending_item_s, node);
      leave_critical_section(irqstate);

      if (item == NULL)
        {
          /* we have free tx buffer, but we don't have pending rx data to
           * input, we start poll the normal tx routine.
           */

          net_unlock();

          return OK;
        }

      ninfo("input stack rx data :%p %d\n", item->data, item->len);

      /* now we have avaliable tx buffer and pending rx data, launch it */

      DEBUGASSERT(item->priv != NULL);
      DEBUGASSERT(item->priv->net_dev.d_buf == NULL);
      DEBUGASSERT(item->data != NULL && item->len > 0);

      item->priv->net_dev.d_buf = item->data;
      item->priv->net_dev.d_len = item->len;
      bl702_net_receive(item->priv);

      DEBUGASSERT(item->priv->net_dev.d_buf == NULL);
      net_unlock();

      kmm_free(item);
    }
}

/****************************************************************************
 * Name: bl702_net_notify
 *
 * Description:
 *   BL702 WiFi notify handler, similar interrupt function
 *
 * Input Parameters:
 *   event: notify type, tx done or received new data
 *   data: The data of the event, may be NULL
 *   len: data length
 *   opaque: customer data
 *
 * Returned Value:
 *   OK on success; a negated errno on failure
 *
 ****************************************************************************/

int bl702_net_notify(uint32_t event, uint8_t *data, int len, void *opaque)
{
  DEBUGASSERT(opaque != NULL);

  struct bl702_net_driver_s *priv =
    (struct bl702_net_driver_s *)opaque;

  DEBUGASSERT(priv == &g_bl702_net[0] || priv == &g_bl702_net[1]);

  int ret;

  if (event & BL702_NET_EVT_TX_DONE)
    {
      /* if we have tx buffer, we put pending input packet first */

      ret = bl702_launch_pending_rx();
      if (ret != OK)
        {
          /* There is no tx buffer, we needn't to poll.. */

