e-yes/nuttx/arch/risc-v/src/bl702/bl702_netdev.c
          return -ENOMEM;
        }

      if (work_available(&priv->availwork))
        {
          /* Schedule to serialize the poll on the worker thread. */

          work_queue(
            ETHWORK, &priv->availwork, bl702_net_txavail_work, priv, 0);
        }
    }

  if (event & BL702_NET_EVT_RX)
    {
      int tx_buf_empty = 0;
      DEBUGASSERT(data != NULL && len > 0);

      if (!IFF_IS_UP(priv->net_dev.d_flags))
        {
          wlinfo("Drop rx packet due to iface not up\n");
          bl_free_rx_buffer(data);

          return OK;
        }

      irqstate_t irqstate = enter_critical_section();
      tx_buf_empty        = BIT_EMPTY(TX_BUFF_BIT_SIZE, &g_tx_buf_indicator);
      leave_critical_section(irqstate);

      if (tx_buf_empty)
        {
          /* pending this packet to list */

          struct rx_pending_item_s *item =
            kmm_malloc(sizeof(struct rx_pending_item_s));
          if (item == NULL)
            {
              wlwarn("failed to alloc rx pending item, drop rx packet!\n");
              bl_free_rx_buffer(data);

              return -ENOMEM;
            }

          list_initialize(&item->node);

          item->data = data;
          item->len  = len;
          item->priv = priv;

          wlinfo("pending rx data :%p %d\n", item->data, item->len);

          irqstate = enter_critical_section();
          list_add_tail(&g_rx_pending, &item->node);
          leave_critical_section(irqstate);
        }
      else
        {
          /* Thanks god, we have tx buffer now, put this packet to stack */

          wlinfo("input stack direct:%p %d\n", data, len);

          net_lock();
          DEBUGASSERT(priv->net_dev.d_buf == NULL);

          priv->net_dev.d_buf = data;
          priv->net_dev.d_len = len;
          bl702_net_receive(priv);

          DEBUGASSERT(priv->net_dev.d_buf == NULL);
          net_unlock();
        }
    }

  return OK;
}

/****************************************************************************
 * Name: bl702_net_ifup
 *
 * Description:
 *   NuttX Callback: Bring up the Wireless interface when an IP address is
 *   provided
 *
 * Input Parameters:
 *   dev - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   The network is locked.
 *
 ****************************************************************************/

static int bl702_net_ifup(struct net_driver_s *dev)
{
#ifdef CONFIG_NET_ICMPv6
  struct bl702_net_driver_s *priv =
    (struct bl702_net_driver_s *)dev->d_private;
#endif

#ifdef CONFIG_NET_IPv4
  ninfo("Bringing up: %ld.%ld.%ld.%ld\n",
        dev->d_ipaddr & 0xff,
        (dev->d_ipaddr >> 8) & 0xff,
        (dev->d_ipaddr >> 16) & 0xff,
        dev->d_ipaddr >> 24);
#endif
#ifdef CONFIG_NET_IPv6
  ninfo("Bringing up: %04x:%04x:%04x:%04x:%04x:%04x:%04x:%04x\n",
        dev->d_ipv6addr[0],
        dev->d_ipv6addr[1],
        dev->d_ipv6addr[2],
        dev->d_ipv6addr[3],
        dev->d_ipv6addr[4],
        dev->d_ipv6addr[5],
        dev->d_ipv6addr[6],
        dev->d_ipv6addr[7]);
#endif

#ifdef CONFIG_NET_ICMPv6
  /* Set up IPv6 multicast address filtering */

  bl702_net_ipv6multicast(priv);
#endif

  return OK;
}

static int bl702_net_soft_reset(void)
{
  int idx;

  wifi_mgmr_sta_disconnect();
  nxsig_sleep(1);
  wifi_mgmr_api_ap_stop();
  nxsig_sleep(1);
  wifi_mgmr_api_idle();
  wifi_mgmr_reset();

  for (idx = 0; idx < BL702_NET_NINTERFACES; idx++)
    {
      g_bl702_net[idx].current_mode = IW_MODE_AUTO;
    }

  return 0;
}

/****************************************************************************
 * Name: bl702_net_ifdown
 *
 * Description:
 *   NuttX Callback: Stop the interface.
 *
 * Input Parameters:
 *   dev - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   The network is locked.
 *
 ****************************************************************************/

static int bl702_net_ifdown(struct net_driver_s *dev)
{
  struct bl702_net_driver_s *priv =
    (struct bl702_net_driver_s *)dev->d_private;
  irqstate_t flags;

  net_lock();

  flags = enter_critical_section();

  leave_critical_section(flags);

  if (priv == &g_bl702_net[0])
    {
      bl702_net_soft_reset();
    }

  net_unlock();
  return OK;
}

/****************************************************************************
 * Name: bl702_net_txavail_work
 *
 * Description:
 *   Perform an out-of-cycle poll on the worker thread.
 *
 * Input Parameters:
 *   arg - Reference to the NuttX driver state structure (cast to void*)
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Runs on a work queue thread.
 *
 ****************************************************************************/

static void bl702_net_txavail_work(void *arg)
{
  struct bl702_net_driver_s *priv = (struct bl702_net_driver_s *)arg;

  net_lock();
  DEBUGASSERT(priv->net_dev.d_buf == NULL);
  DEBUGASSERT(priv->push_cnt == 0);

  /* Ignore the notification if the interface is not yet up */

  if (!IFF_IS_UP(priv->net_dev.d_flags))
    {
      net_unlock();
      return;
    }

  priv->net_dev.d_buf = bl702_netdev_alloc_txbuf();
  if (priv->net_dev.d_buf)
    {
      priv->net_dev.d_buf += PRESERVE_80211_HEADER_LEN;
      priv->net_dev.d_len = 0;
    }

  /* If so, then poll the network for new XMIT data */

  if (priv->net_dev.d_buf)
    {
      devif_poll(&priv->net_dev, bl702_net_txpoll);

      if (priv->push_cnt != 0)
        {
          /* notify to tx now */

          bl_irq_handler();
          priv->push_cnt = 0;
        }

      if (priv->net_dev.d_buf != NULL)
        {
          bl702_netdev_free_txbuf(priv->net_dev.d_buf -
                                  PRESERVE_80211_HEADER_LEN);
          priv->net_dev.d_buf = NULL;
        }
      else
        {
          work_queue(
            ETHWORK, &priv->availwork, bl702_net_txavail_work, priv, 0);
        }
    }

  DEBUGASSERT(priv->net_dev.d_buf == NULL);
  net_unlock();
}

/****************************************************************************
 * Name: bl702_net_txavail
 *
 * Description:
 *   Driver callback invoked when new TX data is available.  This is a
 *   stimulus perform an out-of-cycle poll and, thereby, reduce the TX
 *   latency.
 *
 * Input Parameters:
 *   dev - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   The network is locked.
 *
 ****************************************************************************/

