e-yes/nuttx/arch/risc-v/src/bl702/bl702_netdev.c
static int bl702_net_txavail(struct net_driver_s *dev)
{
  struct bl702_net_driver_s *priv =
    (struct bl702_net_driver_s *)dev->d_private;

  if (work_available(&priv->availwork))
    {
      /* Schedule to serialize the poll on the worker thread. */

      work_queue(ETHWORK, &priv->availwork, bl702_net_txavail_work, priv, 0);
    }

  return OK;
}

/****************************************************************************
 * Name: bl702_net_addmac
 *
 * Description:
 *   NuttX Callback: Add the specified MAC address to the hardware multicast
 *   address filtering
 *
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *   mac  - The MAC address to be added
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno value on failure.
 *
 ****************************************************************************/

#if defined(CONFIG_NET_MCASTGROUP) || defined(CONFIG_NET_ICMPv6)
static int bl702_net_addmac(struct net_driver_s *dev,
                            const uint8_t *mac)
{
  struct bl702_net_driver_s *priv =
    (struct bl702_net_driver_s *)dev->d_private;

  /* Add the MAC address to the hardware multicast routing table */

  return OK;
}
#endif

/****************************************************************************
 * Name: bl702_net_rmmac
 *
 * Description:
 *   NuttX Callback: Remove the specified MAC address from the hardware
 *   multicast address filtering
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *   mac  - The MAC address to be removed
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno value on failure.
 *
 ****************************************************************************/

#ifdef CONFIG_NET_MCASTGROUP
static int bl702_net_rmmac(struct net_driver_s *dev,
                           const uint8_t *mac)
{
  struct bl702_net_driver_s *priv =
    (struct bl702_net_driver_s *)dev->d_private;

  /* Add the MAC address to the hardware multicast routing table */

  return OK;
}
#endif

/****************************************************************************
 * Name: bl702_net_ipv6multicast
 *
 * Description:
 *   Configure the IPv6 multicast MAC address.
 *
 * Input Parameters:
 *   priv - A reference to the private driver state structure
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno value on failure.
 *
 ****************************************************************************/

#ifdef CONFIG_NET_ICMPv6
static void bl702_net_ipv6multicast(struct bl702_net_driver_s *priv)
{
  struct net_driver_s *dev;
  uint16_t                 tmp16;
  uint8_t                  mac[6];

  /* For ICMPv6, we need to add the IPv6 multicast address
   *
   * For IPv6 multicast addresses, the Wireless MAC is derived by
   * the four low-order octets OR'ed with the MAC 33:33:00:00:00:00,
   * so for example the IPv6 address FF02:DEAD:BEEF::1:3 would map
   * to the Wireless MAC address 33:33:00:01:00:03.
   *
   * NOTES:  This appears correct for the ICMPv6 Router Solicitation
   * Message, but the ICMPv6 Neighbor Solicitation message seems to
   * use 33:33:ff:01:00:03.
   */

  mac[0] = 0x33;
  mac[1] = 0x33;

  dev    = &priv->net_dev;
  tmp16  = dev->d_ipv6addr[6];
  mac[2] = 0xff;
  mac[3] = tmp16 >> 8;

  tmp16  = dev->d_ipv6addr[7];
  mac[4] = tmp16 & 0xff;
  mac[5] = tmp16 >> 8;

  ninfo("IPv6 Multicast: %02x:%02x:%02x:%02x:%02x:%02x\n",
        mac[0],
        mac[1],
        mac[2],
        mac[3],
        mac[4],
        mac[5]);

  bl702_net_addmac(dev, mac);

#ifdef CONFIG_NET_ICMPv6_AUTOCONF
  /* Add the IPv6 all link-local nodes MAC address.  This is the
   * address that we expect to receive ICMPv6 Router Advertisement
   * packets.
   */

  bl702_net_addmac(dev, g_ipv6_ethallnodes.ether_addr_octet);

#endif /* CONFIG_NET_ICMPv6_AUTOCONF */

#ifdef CONFIG_NET_ICMPv6_ROUTER
  /* Add the IPv6 all link-local routers MAC address.  This is the
   * address that we expect to receive ICMPv6 Router Solicitation
   * packets.
   */

  bl702_net_addmac(dev, g_ipv6_ethallrouters.ether_addr_octet);

#endif /* CONFIG_NET_ICMPv6_ROUTER */
}
#endif /* CONFIG_NET_ICMPv6 */

static void scan_complete_indicate(void *data, void *param)
{
  int                        i;
  struct scan_parse_param_s *para;
  wifi_mgmr_scan_item_t *    scan;

  para = (struct scan_parse_param_s *)data;
  DEBUGASSERT(para != NULL);
  DEBUGASSERT(para->priv != NULL);
  g_state.scan_result_len = 0;

  for (i = 0;
       i < sizeof(WIFI_MGMR.scan_items) / sizeof(WIFI_MGMR.scan_items[0]);
       i++)
    {
      scan = &WIFI_MGMR.scan_items[i];

      if (wifi_mgmr_scan_item_is_timeout(&WIFI_MGMR,
                                         &(WIFI_MGMR.scan_items[i])))
        {
          scan->is_used = 0;
        }
      else if (scan->is_used)
        {
          if (para->priv->channel != 0 &&
              scan->channel != para->priv->channel)
            {
              scan->is_used = 0;
            }
          else if (para->flags & IW_SCAN_THIS_ESSID)
            {
              if (strncmp(scan->ssid,
                          (char *)para->scan_req.essid,
                          sizeof(scan->ssid)) == 0)
                {
                  scan->is_used = 1;
                  g_state.scan_result_len++;
                }
              else
                {
                  scan->is_used = 0;
                }
            }
          else
            {
              g_state.scan_result_len++;
            }
        }
    }

  kmm_free(data);
  return;
}

static int rssi_compare(const void *arg1, const void *arg2)
{
  wifi_mgmr_scan_item_t *item1 = &WIFI_MGMR.scan_items[*(uint8_t *)arg1];
  wifi_mgmr_scan_item_t *item2 = &WIFI_MGMR.scan_items[*(uint8_t *)arg2];

  return item1->rssi - item2->rssi;
}

static int format_scan_result_to_wapi(struct iwreq *req, int result_cnt)
{
  int      i = 0;
  int      j = 0;
  int      event_buff_len = 0;
  uint8_t *curr_pos       = NULL;

  uint8_t *rssi_list = NULL; /* for sort */

  if (result_cnt == 0)
    {
      return OK;
    }

  /* More compact arrangement */

