e-yes/nuttx/arch/risc-v/src/bl702/bl702_netdev.c
  event_buff_len = result_cnt *
    (offsetof(struct iw_event, u) * 4 + sizeof(struct sockaddr) +
    sizeof(struct iw_freq) + sizeof(struct iw_quality) +
    sizeof(struct iw_point) + IW_ESSID_MAX_SIZE);

  if (req->u.data.length == 0 || req->u.data.length < event_buff_len)
    {
      return -E2BIG;
    }

  req->u.data.length = event_buff_len;

  /* alloc rssi list */

  rssi_list = kmm_malloc(result_cnt * sizeof(uint8_t));
  if (rssi_list == NULL)
    {
      return -ENOMEM;
    }

  /* record all valid scan result items */

  for (i = 0, j = 0;
       i < sizeof(WIFI_MGMR.scan_items) / sizeof(WIFI_MGMR.scan_items[0]);
       i++)
    {
      wifi_mgmr_scan_item_t *scan = &WIFI_MGMR.scan_items[i];

      if (scan->is_used == 0)
        {
          continue;
        }

      rssi_list[j++] = i;
    }

  DEBUGASSERT(j == result_cnt);

  /* sort the valid list according the rssi */

  qsort(rssi_list, result_cnt, sizeof(uint8_t), rssi_compare);

  /* construct iw event buffer */

  curr_pos = req->u.data.pointer;
  DEBUGASSERT(curr_pos != NULL);
  DEBUGASSERT(((uintptr_t)curr_pos & 0x3) == 0);

  for (i = 0; i < result_cnt; i++)
    {
      int                    idx  = rssi_list[i];
      wifi_mgmr_scan_item_t *scan = &WIFI_MGMR.scan_items[idx];

      struct iw_event *iwe;

      iwe = (struct iw_event *)curr_pos;
      DEBUGASSERT(((uintptr_t)iwe & 0x3) == 0);
      iwe->len = offsetof(struct iw_event, u) + sizeof(struct sockaddr);
      iwe->cmd = SIOCGIWAP;
      memcpy(iwe->u.ap_addr.sa_data, scan->bssid, sizeof(struct ether_addr));

      iwe = (struct iw_event *)((uintptr_t)iwe + iwe->len);
      DEBUGASSERT(((uintptr_t)iwe & 0x3) == 0);
      iwe->len      = offsetof(struct iw_event, u) + sizeof(struct iw_freq);
      iwe->cmd      = SIOCGIWFREQ;
      iwe->u.freq.e = 0;
      iwe->u.freq.m = scan->channel;

      iwe = (struct iw_event *)((uintptr_t)iwe + iwe->len);
      DEBUGASSERT(((uintptr_t)iwe & 0x3) == 0);
      iwe->len = offsetof(struct iw_event, u) + sizeof(struct iw_quality);
      iwe->cmd = IWEVQUAL;
      iwe->u.qual.level   = scan->rssi;
      iwe->u.qual.updated = IW_QUAL_DBM;

      iwe = (struct iw_event *)((uintptr_t)iwe + iwe->len);
      DEBUGASSERT(((uintptr_t)iwe & 0x3) == 0);
      iwe->len = offsetof(struct iw_event, u) + sizeof(struct iw_point) +
                 IW_ESSID_MAX_SIZE;
      iwe->cmd            = SIOCGIWESSID;
      iwe->u.essid.length = strlen(scan->ssid);
      iwe->u.essid.flags  = 1;

      /* refer:wapi wireless.c:272 */

      iwe->u.essid.pointer = (void *)(uintptr_t)sizeof(struct iw_point);

      memcpy((uint8_t *)iwe + offsetof(struct iw_event, u) +
               sizeof(struct iw_point),
             scan->ssid,
             IW_ESSID_MAX_SIZE);

      curr_pos = (uint8_t *)(uintptr_t)iwe + iwe->len;
    }

  kmm_free(rssi_list);

  return OK;
}

static wifi_mgmr_t *
bl702_netdev_get_wifi_mgmr(struct bl702_net_driver_s *priv)
{
  if (priv->current_mode == IW_MODE_INFRA)
    {
      return container_of(priv->wlan, wifi_mgmr_t, wlan_sta);
    }
  else if (priv->current_mode == IW_MODE_MASTER)
    {
      return container_of(priv->wlan, wifi_mgmr_t, wlan_ap);
    }
  else
    {
      return NULL;
    }
}

#ifdef CONFIG_NETDEV_IOCTL
static int bl702_ioctl_wifi_start(struct bl702_net_driver_s *priv,
                                  uintptr_t                      arg)
{
  UNUSED(arg);

  /* preform connect ap */

  wifi_mgmr_t *mgmr = bl702_netdev_get_wifi_mgmr(priv);
  if (mgmr == NULL)
    {
      return -EPERM;
    }

  if (priv->current_mode == IW_MODE_INFRA)
    {
      int state;

      if (g_state.sta_connected == 1)
        {
          return OK;
        }

      priv->prev_connectd = 0;
      g_state.retry_cnt = 0;

      wifi_mgmr_sta_autoconnect_enable();
      if (wifi_mgmr_sta_connect(NULL, mgmr->wifi_mgmr_stat_info.ssid,
                                mgmr->wifi_mgmr_stat_info.passphr,
                                NULL,
                                (uint8_t *)priv->bssid,
                                0,
                                priv->channel) == -1)
        {
          return -EPIPE;
        }

      nxsem_wait(&g_wifi_connect_sem);

      /* check connect state */

      wifi_mgmr_state_get_internal(&state);
      if (state != WIFI_STATE_CONNECTED_IP_GOT)
        {
          return -EPIPE;
        }
    }
  else if (priv->current_mode == IW_MODE_MASTER)
    {
      int channel;

      if (g_state.ap_stared == 1)
        {
          return OK;
        }

      wifi_mgmr_channel_get(&channel);
      wlinfo("AP channel:%d\n", channel);

      if (wifi_mgmr_api_ap_start(mgmr->wifi_mgmr_stat_info.ssid,
                                 mgmr->wifi_mgmr_stat_info.passphr,
                                 channel ? channel : 1,
                                 0) < 0)
        {
          return -EPIPE;
        }
    }
  else
    {
      return -ENOSYS;
    }

  return OK;
}

static int bl702_ioctl_wifi_stop(struct bl702_net_driver_s *priv,
                                 uintptr_t                      arg)
{
  UNUSED(arg);

  /* perform disconnect */

  if (priv->current_mode == IW_MODE_INFRA)
    {
      if (g_state.sta_connected == 0)
        {
          return OK;
        }

      wifi_mgmr_sta_disconnect();
      nxsig_sleep(1);
      wifi_mgmr_api_idle();
    }
  else if (priv->current_mode == IW_MODE_MASTER)
    {
      if (g_state.ap_stared == 0)
        {
          return OK;
        }

      wifi_mgmr_api_ap_stop();
      nxsig_sleep(1);
      wifi_mgmr_api_idle();
    }

  return OK;
}

/****************************************************************************
 * Name: bl702_net_ioctl
 *
 * Description:
 *   Handle network IOCTL commands directed to this device.
 *
 * Input Parameters:
 *   dev - Reference to the NuttX driver state structure
 *   cmd - The IOCTL command
 *   arg - The argument for the IOCTL command
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *   The network is locked.
 *
 ****************************************************************************/

static int
bl702_net_ioctl(struct net_driver_s *dev, int cmd, unsigned long arg)
{
  struct bl702_net_driver_s *priv =
    (struct bl702_net_driver_s *)dev->d_private;
  int ret = -ENOSYS;

