e-yes/nuttx/arch/risc-v/src/bl702/bl702_netdev.c
  /* Decode and dispatch the driver-specific IOCTL command */

  switch (cmd)
    {
    case SIOCSIWSCAN:
      do
        {
          struct iwreq *             req  = (struct iwreq *)arg;
          struct scan_parse_param_s *para = NULL;

          para = kmm_malloc(sizeof(struct scan_parse_param_s));
          if (para == NULL)
            {
              return -ENOMEM;
            }

          para->priv = priv;
          if (req->u.data.flags)
            {
              if (req->u.data.pointer == NULL)
                {
                  kmm_free(para);
                  return -EINVAL;
                }

              para->flags = req->u.data.flags;
              para->scan_req = *(struct iw_scan_req *)req->u.data.pointer;
            }
          else
            {
              para->flags = 0;
            }

          if (nxsem_trywait(&g_wifi_scan_sem) == 0)
            {
              if (priv->channel != 0)
                {
                  const char *ssid = para->flags & IW_SCAN_THIS_ESSID ?
                    (char *)para->scan_req.essid : NULL;
                  wifi_mgmr_scan_adv(para, scan_complete_indicate,
                      &priv->channel, 1, ssid);
                }
              else
                {
                  const char *ssid = para->flags & IW_SCAN_THIS_ESSID ?
                    (char *)para->scan_req.essid : NULL;
                  wifi_mgmr_scan_adv(para, scan_complete_indicate,
                      NULL, 0, ssid);
                }

              return OK;
            }
          else
            {
              kmm_free(para);
              return -EBUSY;
            }
        }
      while (0);
      break;

    case SIOCGIWSCAN:
      do
        {
          struct iwreq *req = (struct iwreq *)arg;

          nxsem_wait(&g_wifi_scan_sem);

          if (g_state.scan_result_status != 0)
            {
              wlwarn("scan failed\n");
              nxsem_post(&g_wifi_scan_sem);
              return -EIO;
            }

          if (g_state.scan_result_len == 0)
            {
              req->u.data.length = 0;
              nxsem_post(&g_wifi_scan_sem);
              return OK;
            }

          ret = format_scan_result_to_wapi(req, g_state.scan_result_len);
          nxsem_post(&g_wifi_scan_sem);
          return ret;
        }
      while (0);
      break;

    case SIOCSIFHWADDR: /* Set device MAC address */
      return -ENOSYS;
      break;

    case SIOCSIWAUTH:
      /* FIXME not support set auth param now, return OK to support
       * wapi reconnect command
       */

      return OK;
      break;

    case SIOCSIWENCODEEXT: /* Set psk */
      do
        {
          struct iwreq *        req        = (struct iwreq *)arg;
          struct iw_encode_ext *ext        = req->u.encoding.pointer;
          char *                passphrase = kmm_malloc(ext->key_len + 1);
          if (passphrase == NULL)
            {
              return -ENOMEM;
            }

          strncpy(passphrase, (char *)ext->key, ext->key_len);
          passphrase[ext->key_len] = 0;

          wifi_mgmr_sta_passphr_set(passphrase);
          kmm_free(passphrase);
          return OK;
        }
      while (0);
      break;

    case SIOCSIWFREQ: /* Set channel/frequency (Hz) */
      do
        {
          struct iwreq *req = (struct iwreq *)arg;

          if (req->u.freq.e != 0)
            {
              return -EINVAL;
            }

          priv->channel = req->u.freq.m;

          wlinfo("set channel to %d\n", priv->channel);

          return OK;
        }
      while (0);
      break;

    case SIOCGIWFREQ: /* Get channel/frequency (Hz) */
      wlwarn("WARNING: SIOCGIWFREQ not implemented\n");
      ret = -ENOSYS;
      break;

    case SIOCSIWMODE: /* Set operation mode */
      do
        {
          struct iwreq *req = (struct iwreq *)arg;
#ifdef CONFIG_BL702_NET_MULTI_INTERFACE
          int interface_idx = priv - g_bl702_net;

          DEBUGASSERT(interface_idx >= 0 &&
              interface_idx < BL702_NET_NINTERFACES);
#endif

          if (req->u.mode == priv->current_mode)
            {
              wlinfo("mode not change\n");
              return OK;
            }

          if (req->u.mode == IW_MODE_INFRA)
            {
              /* station */

#ifdef CONFIG_BL702_NET_MULTI_INTERFACE
              if (interface_idx != 0)
                {
                  wlwarn("The interface does not support this mode.\n");
                  return -ENOSYS;
                }
#endif

              priv->wlan = wifi_mgmr_sta_enable((void *)priv);

              memcpy(priv->wlan->mac,
                     priv->net_dev.d_mac.ether.ether_addr_octet,
                     6);
              wlinfo("now in station mode\n");
              priv->current_mode = IW_MODE_INFRA;
              return OK;
            }
          else if (req->u.mode == IW_MODE_MASTER)
            {
              /* AP Mode */

#ifdef CONFIG_BL702_NET_MULTI_INTERFACE
              if (interface_idx != 1)
                {
                  wlwarn("The interface does not support this mode.\n");
                  return -ENOSYS;
                }
#endif

              priv->wlan = wifi_mgmr_ap_enable((void *)priv);
              memcpy(priv->wlan->mac,
                     priv->net_dev.d_mac.ether.ether_addr_octet,
                     6);
              wlinfo("now in ap state\n");
              priv->current_mode = IW_MODE_MASTER;
              return OK;
            }
          else
            {
              wlwarn("WARNING: Unsupport mode:%ld\n", req->u.mode);
              return -ENOSYS;
            }
        }
      while (0);
      break;

    case SIOCGIWMODE: /* Get operation mode */
      do
        {
          struct iwreq *req = (struct iwreq *)arg;
          req->u.mode       = priv->current_mode;
          return OK;
        }
      while (0);
      break;

    case SIOCSIWAP: /* Set access point MAC addresses */
      do
        {
          struct iwreq *req = (struct iwreq *)arg;
          if (priv->current_mode == IW_MODE_INFRA)
            {
              /* Set bssid */

              memcpy(
                priv->bssid, req->u.ap_addr.sa_data, sizeof(priv->bssid));
              wlinfo("ap bssid:%s\n", priv->bssid);
            }
          else if (priv->current_mode == IW_MODE_MASTER)
            {
              bl_wifi_ap_mac_addr_set((uint8_t *)req->u.ap_addr.sa_data);
            }
          else
            {
              return -ENOSYS;
            }

          return OK;
        }
      while (0);
      break;

    case SIOCGIWAP: /* Get access point MAC addresses */
      do
        {
          struct iwreq *req = (struct iwreq *)arg;
          if (priv->current_mode == IW_MODE_INFRA)
            {
              /* Get bssid */

              memcpy(req->u.ap_addr.sa_data,
                     priv->bssid,
                     sizeof(req->u.ap_addr.sa_data));
            }
          else if (priv->current_mode == IW_MODE_MASTER)
            {
              bl_wifi_ap_mac_addr_get((uint8_t *)req->u.ap_addr.sa_data);
            }

          return OK;
        }
      while (0);
      break;

