e-yes/nuttx/arch/risc-v/src/bl702/bl702_netdev.c
    case SIOCSIWESSID: /* Set ESSID (network name) */
      do
        {
          struct iwreq *req = (struct iwreq *)arg;

          wifi_mgmr_sta_ssid_set(req->u.essid.pointer);

          wlinfo("essid: %s\n", (char *)req->u.essid.pointer);

          if (req->u.essid.flags == 0)
            {
              return bl702_ioctl_wifi_stop(priv, arg);
            }
          else if (req->u.essid.flags == 1)
            {
              return bl702_ioctl_wifi_start(priv, arg);
            }
          else
            {
              wlinfo("unknow essid action: %d\n", req->u.essid.flags);
              return -ENOSYS;
            }
        }
      while (0);
      break;

    case SIOCGIWESSID: /* Get ESSID */
      do
        {
          struct iwreq *req  = (struct iwreq *)arg;
          wifi_mgmr_t * mgmr = bl702_netdev_get_wifi_mgmr(priv);
          int           length;

          DEBUGASSERT(req->u.essid.length > 0);
          DEBUGASSERT(req->u.essid.pointer != NULL);

          if (mgmr == NULL)
            {
              *(uint8_t *)req->u.essid.pointer = 0;

              return OK;
            }

          length = strlen(mgmr->wifi_mgmr_stat_info.ssid) + 1;
          length =
            length > req->u.essid.length ? req->u.essid.length : length;

          memcpy(
            req->u.essid.pointer, mgmr->wifi_mgmr_stat_info.ssid, length);

          return OK;
        }
      while (0);
      break;

    case SIOCSIWRATE: /* Set default bit rate (bps) */
      wlwarn("WARNING: SIOCSIWRATE not implemented\n");
      ret = -ENOSYS;
      break;

    case SIOCGIWRATE: /* Get default bit rate (bps) */
      wlwarn("WARNING: SIOCGIWRATE not implemented\n");
      ret = -ENOSYS;
      break;

    case SIOCSIWTXPOW: /* Set transmit power (dBm) */
      wlwarn("WARNING: SIOCSIWTXPOW not implemented\n");
      ret = -ENOSYS;
      break;

    case SIOCGIWTXPOW: /* Get transmit power (dBm) */
      wlwarn("WARNING: SIOCGIWTXPOW not implemented\n");
      ret = -ENOSYS;
      break;

    case SIOCGIWENCODEEXT: /* Get encoding token mode */
      do
        {
          struct iwreq *        req = (struct iwreq *)arg;
          struct iw_encode_ext *ext;
          wifi_mgmr_t *         mgmr = bl702_netdev_get_wifi_mgmr(priv);
          int                   length;

          DEBUGASSERT(mgmr != NULL);

          ext      = (struct iw_encode_ext *)req->u.encoding.pointer;
          length   = req->u.encoding.length - sizeof(struct iw_encode_ext);
          ext->alg = IW_ENCODE_ALG_NONE;
          ext->key_len = strlen(mgmr->wifi_mgmr_stat_info.passphr);
          if (ext->key_len > length)
            {
              return -E2BIG;
            }

          memcpy(ext->key, mgmr->wifi_mgmr_stat_info.passphr, ext->key_len);

          return OK;
        }
      while (0);
      break;

    case SIOCSIWCOUNTRY: /* Set country code */
      do
        {
          struct iwreq *req = (struct iwreq *)arg;

          ret = wifi_mgmr_set_country_code(req->u.data.pointer);
          if (ret != 0)
            {
              return -EINVAL;
            }

          return OK;
        }
      while (0);
      break;

    default:
      wlerr("ERROR: Unrecognized IOCTL command: %d\n", cmd);
      return -ENOTTY; /* Special return value for this case */
    }

  return OK;
}
#endif

static int wifi_manager_process(int argc, char *argv[])
{
  bl_pm_init();
  wifi_main_init();
  ipc_emb_notify();

  wifi_mgmr_drv_init(&g_conf);
  wifi_mgmr_tsk_init();

  return 0;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: bl702_netdev_alloc_txbuf
 *
 * Description:
 *   Allocate wifi transmit buffer
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Non-zero: Buffer address, otherwise error.
 *
 ****************************************************************************/

uint8_t *bl702_netdev_alloc_txbuf(void)
{
  irqstate_t irq = enter_critical_section();
  int        idx = BIT_FFS(TX_BUFF_BIT_SIZE, &g_tx_buf_indicator);
  if (idx == 0)
    {
      leave_critical_section(irq);
      wlwarn("tx buff alloc failed!\n");
      return NULL;
    }

  wlinfo("tx buff alloc:%d\n", idx - 1);
  BIT_CLR(TX_BUFF_BIT_SIZE, idx - 1, &g_tx_buf_indicator);
  leave_critical_section(irq);

  return g_tx_buff[idx - 1];
}

/****************************************************************************
 * Name: bl702_netdev_free_txbuf
 *
 * Description:
 *   Free wifi transmit buffer
 *
 * Input Parameters:
 *   buf: The address of the buffer to be released.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

void bl702_netdev_free_txbuf(uint8_t *buf)
{
  irqstate_t irq;
  int        idx;

  idx = (tx_buff_t)buf - g_tx_buff;

  DEBUGASSERT(idx < BL702_NET_TXBUFF_NUM && idx >= 0);
  DEBUGASSERT(g_tx_buff[idx] == buf);

  wlinfo("tx buff free %d\n", idx);

  irq = enter_critical_section();
  DEBUGASSERT(!BIT_ISSET(TX_BUFF_BIT_SIZE, idx, &g_tx_buf_indicator));
  BIT_SET(TX_BUFF_BIT_SIZE, idx, &g_tx_buf_indicator);
  leave_critical_section(irq);
}

/****************************************************************************
 * Name: bl702_net_event
 *
 * Description:
 *   BL702 WiFi event handler, called by BL702 wifi manager private library
 *
 * Input Parameters:
 *   event: event number
 *   val: the value of the event
 *
 * Returned Value:
 *   OK on success; a negated errno on failure
 *
 ****************************************************************************/

void bl702_net_event(int evt, int val)
{
  net_lock();

  switch (evt)
    {
    case CODE_WIFI_ON_CONNECTED:
      do
        {
          struct bl702_net_driver_s *priv = &g_bl702_net[0];
          priv->prev_connectd = 1;
          g_state.sta_connected = 1;

          netdev_carrier_on(&priv->net_dev);

          wifi_mgmr_sta_autoconnect_disable();
          nxsem_post(&g_wifi_connect_sem);
        }
      while (0);
      break;

    case CODE_WIFI_ON_DISCONNECT:
      do
        {
          /* struct bl702_net_driver_s *priv = &g_bl702_net[0]; */

          if (g_state.sta_connected == 1)
            {
              /* netdev_carrier_off(&priv->net_dev); */

              g_state.sta_connected = 0;
            }
        }
      while (0);
      break;

    case CODE_WIFI_CMD_RECONNECT:
      do
        {
          struct bl702_net_driver_s *priv = &g_bl702_net[0];

          wlinfo("retry connect : %d\n", g_state.retry_cnt);
          if (!priv->prev_connectd)
            {
              if (g_state.retry_cnt++ > 3)
                {
                  wifi_mgmr_sta_autoconnect_disable();
                  wifi_mgmr_api_idle();

                  nxsem_post(&g_wifi_connect_sem);
                }
            }
        }
      while (0);
      break;

    case CODE_WIFI_ON_SCAN_DONE:
      do
        {
          g_state.scan_result_status = val;
          nxsem_post(&g_wifi_scan_sem);
        }
      while (0);

    case CODE_WIFI_ON_AP_STARTED:
      do
        {
#ifdef CONFIG_BL702_NET_MULTI_INTERFACE
          struct bl702_net_driver_s *priv = &g_bl702_net[1];
          netdev_carrier_on(&priv->net_dev);
#endif
          g_state.ap_stared = 1;
        }
      while (0);
      break;

    case CODE_WIFI_ON_AP_STOPPED:
      do
        {
#ifdef CONFIG_BL702_NET_MULTI_INTERFACE
          struct bl702_net_driver_s *priv = &g_bl702_net[1];
          netdev_carrier_off(&priv->net_dev);
#endif
          g_state.ap_stared = 0;
        }
      while (0);
      break;

    default:
      wlwarn("unhandled msg:%d\n", evt);
      break;
    }

  net_unlock();
}

/****************************************************************************
 * Name: bl702_net_initialize
 *
 * Description:
 *   Initialize the Wireless controller and driver
 *
 * Input Parameters:
 *    None
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *   Called early in initialization before multi-tasking is initiated.
 *
 ****************************************************************************/

