e-yes/nuttx/arch/risc-v/src/bl702/bl702_netdev.c
int bl702_net_initialize(void)
{
  struct bl702_net_driver_s *priv;
  int                            tmp;
  int                            idx;
  uint8_t                        mac[6];

  /* Initialize scan semaphore */

  tmp = sem_init(&g_wifi_scan_sem, 0, 1);
  if (tmp < 0)
    {
      return tmp;
    }

  tmp = sem_init(&g_wifi_connect_sem, 0, 0);
  if (tmp < 0)
    {
      return tmp;
    }

  list_initialize(&g_rx_pending);

  /* Start wifi process */

  wifi_manager_process(0, NULL);

  /* Read the MAC address from the hardware into
   * priv->net_dev.d_mac.ether.ether_addr_octet
   * Applies only if the Wireless MAC has its own internal address.
   */

  bl702_efuse_read_mac_address(mac);
  wlinfo(":::MAC:%x %x %x %x %x %x\n",
         mac[0],
         mac[1],
         mac[2],
         mac[3],
         mac[4],
         mac[5]);

  for (idx = 0; idx < BL702_NET_NINTERFACES; idx++)
    {
      /* Get the interface structure associated with this interface number. */

      priv = &g_bl702_net[idx];

      /* Initialize the driver structure */

      memset(priv, 0, sizeof(struct bl702_net_driver_s));
      priv->net_dev.d_ifup =
        bl702_net_ifup; /* I/F up (new IP address) callback */

      priv->net_dev.d_ifdown  = bl702_net_ifdown;  /* I/F down callback */
      priv->net_dev.d_txavail = bl702_net_txavail; /* New TX data callback */
#ifdef CONFIG_NET_MCASTGROUP
      priv->net_dev.d_addmac = bl702_net_addmac; /* Add multicast MAC address */
      priv->net_dev.d_rmmac  = bl702_net_rmmac;  /* Remove multicast MAC address */
#endif
#ifdef CONFIG_NETDEV_IOCTL
      priv->net_dev.d_ioctl = bl702_net_ioctl; /* Handle network IOCTL commands */
#endif
      priv->net_dev.d_private = priv; /* Used to recover private state from dev */
      priv->net_dev.d_pktsize =
        BL702_NET_TXBUFF_SIZE - PRESERVE_80211_HEADER_LEN;

#ifdef CONFIG_BL702_NET_MULTI_INTERFACE
      /* Set AP's MAC address equals STA's MAC */

      memcpy(priv->net_dev.d_mac.ether.ether_addr_octet, mac, 6);

      if (idx == 0)
        {
          bl_wifi_sta_mac_addr_set(
              priv->net_dev.d_mac.ether.ether_addr_octet);
        }
      else
        {
          bl_wifi_ap_mac_addr_set(
              priv->net_dev.d_mac.ether.ether_addr_octet);
        }
#else
      DEBUGASSERT(idx == 0);

      memcpy(priv->net_dev.d_mac.ether.ether_addr_octet, mac, 6);
      bl_wifi_sta_mac_addr_set(priv->net_dev.d_mac.ether.ether_addr_octet);
      bl_wifi_ap_mac_addr_set(priv->net_dev.d_mac.ether.ether_addr_octet);
#endif

      /* Enable scan hidden SSID */

      wifi_mgmr_scan_filter_hidden_ssid(0);

      priv->current_mode    = IW_MODE_AUTO;

      /* Register the device with the OS so that socket IOCTLs can be
       * performed
       */

      tmp = netdev_register(&priv->net_dev, NET_LL_IEEE80211);
      if (tmp < 0)
        {
          sem_destroy(&g_wifi_scan_sem);
          return tmp;
        }
    }

  return OK;
}

#endif /* CONFIG_NET_BL702_NETDEV */
